#include <iostream>
using namespace std;
int main() {
	short x, y, z, res;
	cout << "Write x, y, z: ";
	cin >> x >> y >> z;
	res = (!x && !y) && (x || y) || (!y && !z) || (y && z) && (z || x) && (!z || !x) || (x || z); // Випереджена нормальна форма формули

	if ((x, y, z) != 0 && (x, y, z) != 1) { // Перевірка на неправильні введені данні
		cout << "Wrong data!";
	}
	else { // Програма будує одну інтерпретацію, залежно від введенних данних
		cout << "---------------------------------------------------\n";
		cout << "| " << "x" << " | " << "y" << " | " << "z" << " | " << "!x" << " | " << "!y" << " | ";
		cout << "1" << " | " << "2" << " | " << "3" << " | " << "4" << " | " << "5" << " | " << "6" << " | " << "7" << " |\n";
		cout << "---------------------------------------------------\n";
		cout << "| " << x << " | " << y << " | " << z << " | " << !x << "  | " << !y << "  | " << ((x && y) || (!x && !y));
		cout << " | " << ((!y && !z) || (y && z)) << " | " << ((!z && !x) || (z && x)) << " | " << (x || z) << " | ";
		cout << ((!((y && z) || (!y && !z))) || ((z && x) || (!z && !x)));
		cout << " | " << ((!((!((y && z) || (!y && !z))) || ((z && x) || (!z && !x)))) || (x || z));
		cout << " | " << ((!((x && y) || (!x && !y))) || ((!((!((y && z) || (!y && !z))) || ((z && x) || (!z && !x)))) || (x || z))) << " |" << endl;
		cout << "---------------------------------------------------\n";
	}
	return 0;
}

